
# Задача - 1
# Запросите у пользователя имя, фамилию, email.
# Теперь необходимо совершить проверки, имя и фамилия должны иметь заглавные первые буквы.
# email - не должен иметь заглавных букв и должен быть в формате: текст в нижнем регистре,
# допускается нижнее подчеркивание и цифры, потом @, потом текст, допускаются цифры, точка, ru или org или com.
# Например:
# Пупкин василий - неверно указано имя,
# te$T@test.net - неверно указан email (спецсимвол, заглавная буква, .net), te_4_st@test.com - верно указан.
import re

name = input("Ввидите имя: ")
name_pattern = "[А-Я][а-я]+"
if re.match(name_pattern, name):
    print("верно указан имя")
else:
    print("неверно указан имя")

surname = input("Ввидите фамилию: ")
surname_pattern = "[А-Я][а-я]+"
if re.match(surname_pattern, surname):
    print("верно указана фамилия")
else:
    print("неверно указана фамилия")

email = input("Ввидите email: ")
email_pattern = "[a-z_0-9]+@[a-z0-9]+\.(ru|com|org)"

if re.match(email_pattern, email):
    print("верно указан email")
else:
    print("неверно указан email")

# Задача - 2:
# Вам дан текст:

some_str = '''
Мороз и солнце; день чудесный!
Еще ты дремлешь, друг прелестный —
Пора, красавица, проснись:
Открой сомкнуты негой взоры
Навстречу северной Авроры,
Звездою севера явись!
Вечор, ты помнишь, вьюга злилась,
На мутном небе мгла носилась;
Луна, как бледное пятно,
Сквозь тучи мрачные желтела,
И ты печальная сидела —
А нынче... погляди в окно:
Под голубыми небесами
Великолепными коврами,
Блестя на солнце, снег лежит;
Прозрачный лес один чернеет,
И ель сквозь иней зеленеет,
И речка подо льдом блестит.
Вся комната янтарным блеском
Озарена. Веселым треском
Трещит затопленная печь.
Приятно думать у лежанки.
Но знаешь: не велеть ли в санки
Кобылку бурую запречь?
Скользя по утреннему снегу,
Друг милый, предадимся бегу
Нетерпеливого коня
И навестим поля пустые,
Леса, недавно столь густые,
И берег, милый для меня.'''

# Необходимо с помощью регулярных выражений определить есть ли в тексте подряд
# более одной точки, при любом исходе сообщите результат пользователю!

some_str_pattern = "\.\."
if re.search(some_str_pattern, some_str):
    print("В тексте есть многоточие")
else:
    print("В тексте нет многоточия")





